In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([11.1,22,33,44])

In [3]:
obj

0    11.1
1    22.0
2    33.0
3    44.0
dtype: float64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.values

array([11.1, 22. , 33. , 44. ])

In [6]:
obj2 = Series([4,7,5,3],index=['a','b','c','d'])

In [7]:
obj2

a    4
b    7
c    5
d    3
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
4 in obj2

False

In [10]:
'b' in obj2

True

In [11]:
obj2

a    4
b    7
c    5
d    3
dtype: int64

In [12]:
obj2.name ='obj222name'

In [13]:
obj2.index.name = 'obj222indexname'

In [14]:
obj2

obj222indexname
a    4
b    7
c    5
d    3
Name: obj222name, dtype: int64

In [15]:
obj2.index = ['aaa','bbb','ccc','ddd']

In [16]:
obj2

aaa    4
bbb    7
ccc    5
ddd    3
Name: obj222name, dtype: int64

In [17]:
data = {'state':['2Ohio','1Ohio','6Ohio','4Nevada','0Nevada'],
        'year':[2000,2002,2001,2003,2004],
        'pop':[1.5,2.7,1.8,2.8,2.0]
       }

frame = DataFrame(data,columns=['pop','year','state'],index=['a','b','c','d','e'])
frame

   pop  year    state
a  1.5  2000    2Ohio
b  2.7  2002    1Ohio
c  1.8  2001    6Ohio
d  2.8  2003  4Nevada
e  2.0  2004  0Nevada

In [18]:
frame['pop']

a    1.5
b    2.7
c    1.8
d    2.8
e    2.0
Name: pop, dtype: float64

In [19]:
frame.pop

<bound method NDFrame.pop of    pop  year    state
a  1.5  2000    2Ohio
b  2.7  2002    1Ohio
c  1.8  2001    6Ohio
d  2.8  2003  4Nevada
e  2.0  2004  0Nevada>

In [20]:
frame.loc['c']

pop        1.8
year      2001
state    6Ohio
Name: c, dtype: object

In [21]:
frame['debt'] = 16.5

In [22]:
frame

   pop  year    state  debt
a  1.5  2000    2Ohio  16.5
b  2.7  2002    1Ohio  16.5
c  1.8  2001    6Ohio  16.5
d  2.8  2003  4Nevada  16.5
e  2.0  2004  0Nevada  16.5

In [23]:
frame['debt'] = np.arange(5)
frame

   pop  year    state  debt
a  1.5  2000    2Ohio     0
b  2.7  2002    1Ohio     1
c  1.8  2001    6Ohio     2
d  2.8  2003  4Nevada     3
e  2.0  2004  0Nevada     4

In [24]:
val = Series([-1,-2,-3],index=['b','c','d'])
frame['debt'] = val

In [25]:
frame

   pop  year    state  debt
a  1.5  2000    2Ohio   NaN
b  2.7  2002    1Ohio  -1.0
c  1.8  2001    6Ohio  -2.0
d  2.8  2003  4Nevada  -3.0
e  2.0  2004  0Nevada   NaN

In [26]:
frame.year

a    2000
b    2002
c    2001
d    2003
e    2004
Name: year, dtype: int64

In [27]:
frame['eastern'] = frame.state == '1Ohio'
frame

   pop  year    state  debt  eastern
a  1.5  2000    2Ohio   NaN    False
b  2.7  2002    1Ohio  -1.0     True
c  1.8  2001    6Ohio  -2.0    False
d  2.8  2003  4Nevada  -3.0    False
e  2.0  2004  0Nevada   NaN    False

In [28]:
del frame['eastern']

In [29]:
frame

   pop  year    state  debt
a  1.5  2000    2Ohio   NaN
b  2.7  2002    1Ohio  -1.0
c  1.8  2001    6Ohio  -2.0
d  2.8  2003  4Nevada  -3.0
e  2.0  2004  0Nevada   NaN

In [30]:
frame.columns

Index(['pop', 'year', 'state', 'debt'], dtype='object')

In [31]:
obj = Series(range(3),index = ['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [32]:
obj = Series(np.random.randn(4) * 10,index = ['d','b','a','c'])
obj

d    -3.182357
b    11.310617
a    -4.901114
c   -21.328030
dtype: float64

In [33]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a    -4.901114
b    11.310617
c   -21.328030
d    -3.182357
e          NaN
dtype: float64

In [34]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a    -4.901114
b    11.310617
c   -21.328030
d    -3.182357
e     0.000000
dtype: float64

In [35]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [36]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [37]:
frame = DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['Ohio',
                                            'Texas','California'])

In [38]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [39]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [40]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [41]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [42]:
frame2.drop('Ohio',axis=1)

   Texas  California
a    1.0         2.0
b    NaN         NaN
c    4.0         5.0
d    7.0         8.0

In [43]:
frame2.drop(['Ohio','Texas'],axis=1)

   California
a         2.0
b         NaN
c         5.0
d         8.0

In [44]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [45]:
obj = Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [46]:
obj['b']

1.0

In [47]:
obj[1]

1.0

In [48]:
obj[2:]

c    2.0
d    3.0
dtype: float64

In [49]:
obj[['b','a','c']]

b    1.0
a    0.0
c    2.0
dtype: float64

In [50]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [51]:
obj['b':'c'] = 90

In [52]:
obj

a     0.0
b    90.0
c    90.0
d     3.0
dtype: float64

In [53]:
data = DataFrame(np.arange(16).reshape(4,4),index=['Oh','Co','Ut','New'],columns=['one','two','three','four'])

In [54]:
data

     one  two  three  four
Oh     0    1      2     3
Co     4    5      6     7
Ut     8    9     10    11
New   12   13     14    15

In [55]:
data['two'] # 列

Oh      1
Co      5
Ut      9
New    13
Name: two, dtype: int32

In [56]:
data.iloc[1]

one      4
two      5
three    6
four     7
Name: Co, dtype: int32

In [57]:
data[:2]

    one  two  three  four
Oh    0    1      2     3
Co    4    5      6     7

In [58]:
data[data['three'] > 5]

     one  two  three  four
Co     4    5      6     7
Ut     8    9     10    11
New   12   13     14    15

In [59]:
data.loc['Oh']

one      0
two      1
three    2
four     3
Name: Oh, dtype: int32

In [60]:
data.ix[['Oh'],[2,0,1]]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    three  one  two
Oh      2    0    1

In [61]:
s1 = Series([7.,6.,5,4],index=['a','c','d','e'])
s1

a    7.0
c    6.0
d    5.0
e    4.0
dtype: float64

In [62]:
s2 = Series([-2,3,1,4,5],index=['a','c','e','f','g'])
s2

a   -2
c    3
e    1
f    4
g    5
dtype: int64

In [63]:
s1 + s2

a    5.0
c    9.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [64]:
df1 = DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [65]:
df2 = DataFrame(np.arange(20.).reshape(4,5),columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [66]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [67]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [68]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [69]:
df1 - df1.loc[0]

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  4.0  4.0  4.0  4.0
2  8.0  8.0  8.0  8.0

In [70]:
Series(range(3),index=['b','e','f'])

b    0
e    1
f    2
dtype: int64

In [71]:
df1 + Series(range(3),index=['b','e','f'])

    a    b   c   d   e   f
0 NaN  1.0 NaN NaN NaN NaN
1 NaN  5.0 NaN NaN NaN NaN
2 NaN  9.0 NaN NaN NaN NaN

In [72]:
series3 = df1['d']
series3

0     3.0
1     7.0
2    11.0
Name: d, dtype: float64

In [73]:
df1.sub(series3,axis=0)

     a    b    c    d
0 -3.0 -2.0 -1.0  0.0
1 -3.0 -2.0 -1.0  0.0
2 -3.0 -2.0 -1.0  0.0

In [74]:
frame = df1
frame

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [75]:
np.abs(frame)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [76]:
f = lambda x : x.max() - x.min()

In [77]:
frame.apply(f)

a    8.0
b    8.0
c    8.0
d    8.0
dtype: float64

In [78]:
frame.apply(f,axis=1)

0    3.0
1    3.0
2    3.0
dtype: float64

In [79]:
format = lambda x : '%.2f' % x
frame.applymap(format)

      a     b      c      d
0  0.00  1.00   2.00   3.00
1  4.00  5.00   6.00   7.00
2  8.00  9.00  10.00  11.00

In [80]:
frame.index

RangeIndex(start=0, stop=3, step=1)

In [81]:
frame.sort_index()

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [82]:
frame = DataFrame(np.arange(8).reshape(2,4),index=['three','one'],columns=['d'
                                                ,'a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [83]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [84]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [85]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [86]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [87]:
frame.sort_values(by=['b','a'],ascending=False)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [88]:
obj = Series(np.random.randn(6) * 10)
obj

0    -2.396957
1     4.909484
2    -2.669126
3    22.843221
4     8.375580
5    20.894894
dtype: float64

In [89]:
obj.rank(method='first')

0    2.0
1    3.0
2    1.0
3    6.0
4    4.0
5    5.0
dtype: float64

In [90]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [91]:
frame.rank()

         d    a    b    c
three  1.0  1.0  1.0  1.0
one    2.0  2.0  2.0  2.0

In [92]:
frame.rank(axis=1)

         d    a    b    c
three  1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0

In [93]:
obj = Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [94]:
obj.index.is_unique

False

In [95]:
obj['a']

a    0
a    1
dtype: int64

In [96]:
df = DataFrame([[1.4,np.nan],[7.2,-4.5],[np.nan,np.nan],[0.75,-1.3]]
              ,index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.20 -4.5
c   NaN  NaN
d  0.75 -1.3

In [97]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.116667 -2.900000
std    3.551174  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.300000 -2.100000
max    7.200000 -1.300000

In [98]:
df.sum()

one    9.35
two   -5.80
dtype: float64

In [99]:
df.sum(axis=1)

a    1.40
b    2.70
c    0.00
d   -0.55
dtype: float64

In [100]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [101]:
df1.corr()

     a    b    c    d
a  1.0  1.0  1.0  1.0
b  1.0  1.0  1.0  1.0
c  1.0  1.0  1.0  1.0
d  1.0  1.0  1.0  1.0

In [102]:
obj = Series(list('cadaabbcc'))
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [103]:
unique = obj.unique()
unique

array(['c', 'a', 'd', 'b'], dtype=object)

In [104]:
unique.sort()
unique

array(['a', 'b', 'c', 'd'], dtype=object)

In [105]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [106]:
pd.value_counts(obj.values,sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [107]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [108]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [109]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [110]:
from numpy import nan as NA

In [111]:
data = Series([1,NA,4,NA,7])

In [112]:
data

0    1.0
1    NaN
2    4.0
3    NaN
4    7.0
dtype: float64

In [113]:
data.dropna()

0    1.0
2    4.0
4    7.0
dtype: float64

In [114]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [115]:
data[data.notnull()]

0    1.0
2    4.0
4    7.0
dtype: float64

In [116]:
data = DataFrame([[1.,6,7],[1,NA,NA],[NA,NA,NA],[NA,3,4]])
data

     0    1    2
0  1.0  6.0  7.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.0  4.0

In [117]:
data.dropna()

     0    1    2
0  1.0  6.0  7.0

In [118]:
data.dropna(how='all')

     0    1    2
0  1.0  6.0  7.0
1  1.0  NaN  NaN
3  NaN  3.0  4.0

In [119]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.0  7.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.0  4.0

In [120]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.0  7.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  3.0  4.0 NaN

In [121]:
data.loc[4] = NA

In [122]:
data

     0    1    2   4
0  1.0  6.0  7.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  3.0  4.0 NaN
4  NaN  NaN  NaN NaN

In [123]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.0  7.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  3.0  4.0
4  NaN  NaN  NaN

In [124]:
data.dropna()

Empty DataFrame
Columns: [0, 1, 2, 4]
Index: []

In [125]:
df = DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.498278  0.391890  0.102166
1 -0.306770 -0.599458  0.750844
2  0.385781 -0.571337  1.489372
3  0.710772  0.019643 -1.838058
4 -0.073472 -1.619447  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [126]:
df.loc[:4,1]

0    0.391890
1   -0.599458
2   -0.571337
3    0.019643
4   -1.619447
Name: 1, dtype: float64

In [127]:
df.loc[:4,1] = NA
df.loc[:2,2] = NA

In [128]:
df

          0         1         2
0 -0.498278       NaN       NaN
1 -0.306770       NaN       NaN
2  0.385781       NaN       NaN
3  0.710772       NaN -1.838058
4 -0.073472       NaN  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [129]:
df.dropna()

          0         1         2
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [130]:
df.dropna(thresh=1)

          0         1         2
0 -0.498278       NaN       NaN
1 -0.306770       NaN       NaN
2  0.385781       NaN       NaN
3  0.710772       NaN -1.838058
4 -0.073472       NaN  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [131]:
df

          0         1         2
0 -0.498278       NaN       NaN
1 -0.306770       NaN       NaN
2  0.385781       NaN       NaN
3  0.710772       NaN -1.838058
4 -0.073472       NaN  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [132]:
df.fillna(0)

          0         1         2
0 -0.498278  0.000000  0.000000
1 -0.306770  0.000000  0.000000
2  0.385781  0.000000  0.000000
3  0.710772  0.000000 -1.838058
4 -0.073472  0.000000  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [133]:
df.fillna({1:0.5,2:-1})

          0         1         2
0 -0.498278  0.500000 -1.000000
1 -0.306770  0.500000 -1.000000
2  0.385781  0.500000 -1.000000
3  0.710772  0.500000 -1.838058
4 -0.073472  0.500000  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [134]:
df

          0         1         2
0 -0.498278       NaN       NaN
1 -0.306770       NaN       NaN
2  0.385781       NaN       NaN
3  0.710772       NaN -1.838058
4 -0.073472       NaN  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [135]:
df.fillna(method='ffill')

          0         1         2
0 -0.498278       NaN       NaN
1 -0.306770       NaN       NaN
2  0.385781       NaN       NaN
3  0.710772       NaN -1.838058
4 -0.073472       NaN  1.218641
5  0.434440 -0.453903 -0.134023
6  0.179983  0.465586 -1.109481

In [136]:
df = DataFrame(np.random.randn(6,3))

In [137]:
df.loc[2:1] =NA

In [138]:
df.loc[4:,2] = NA

In [139]:
df

          0         1         2
0 -1.547282 -1.253331  0.860659
1  0.336810 -0.626906  1.316243
2  0.138686  1.040384 -0.581219
3  0.435434 -0.854284 -0.531893
4  1.139598 -0.582627       NaN
5 -0.390326 -0.824678       NaN

In [140]:
df.fillna(method='ffill',limit=1)

          0         1         2
0 -1.547282 -1.253331  0.860659
1  0.336810 -0.626906  1.316243
2  0.138686  1.040384 -0.581219
3  0.435434 -0.854284 -0.531893
4  1.139598 -0.582627 -0.531893
5 -0.390326 -0.824678       NaN

In [141]:
df.fillna(method='bfill')

          0         1         2
0 -1.547282 -1.253331  0.860659
1  0.336810 -0.626906  1.316243
2  0.138686  1.040384 -0.581219
3  0.435434 -0.854284 -0.531893
4  1.139598 -0.582627       NaN
5 -0.390326 -0.824678       NaN

In [142]:
data = Series([1.,NA,3.5,NA,7])

In [143]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [144]:
data = Series(np.random.randn(10),index=[list('aaabbbccdd'),[1,2,3,1,2,3,1,2,2,3]])
data

a  1   -0.285079
   2    1.359208
   3   -0.621346
b  1   -1.607631
   2   -2.040628
   3   -0.385969
c  1    1.067766
   2   -1.461080
d  2   -0.424152
   3   -0.176326
dtype: float64

In [145]:
 data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [146]:
data['b']

1   -1.607631
2   -2.040628
3   -0.385969
dtype: float64

In [147]:
data[:,2]

a    1.359208
b   -2.040628
c   -1.461080
d   -0.424152
dtype: float64

In [148]:
data[:,1]

a   -0.285079
b   -1.607631
c    1.067766
dtype: float64

In [149]:
data

a  1   -0.285079
   2    1.359208
   3   -0.621346
b  1   -1.607631
   2   -2.040628
   3   -0.385969
c  1    1.067766
   2   -1.461080
d  2   -0.424152
   3   -0.176326
dtype: float64

In [150]:
data.unstack()

          1         2         3
a -0.285079  1.359208 -0.621346
b -1.607631 -2.040628 -0.385969
c  1.067766 -1.461080       NaN
d       NaN -0.424152 -0.176326

In [151]:
data.unstack().stack()

a  1   -0.285079
   2    1.359208
   3   -0.621346
b  1   -1.607631
   2   -2.040628
   3   -0.385969
c  1    1.067766
   2   -1.461080
d  2   -0.424152
   3   -0.176326
dtype: float64

In [152]:
data

a  1   -0.285079
   2    1.359208
   3   -0.621346
b  1   -1.607631
   2   -2.040628
   3   -0.385969
c  1    1.067766
   2   -1.461080
d  2   -0.424152
   3   -0.176326
dtype: float64

In [154]:
frame = DataFrame(np.arange(12).reshape(4,3),index=[list('aabb'),[1,2,1,2]]
                  ,columns=[['O','O','C'],['G','R','G']])
frame

     O       C
     G   R   G
a 1  0   1   2
  2  3   4   5
b 1  6   7   8
  2  9  10  11

In [155]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two',
                            'two','two','two'],'d':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [157]:
frame2 = frame.set_index(['c','d'])

In [158]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [159]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1